DebtManagment/src/Documents/ОбещанныйПлатеж/ОбещанныйПлатеж.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ОбещанныйПлатеж</name>
  <registerRecords>InformationRegister.ОбещанныеПлатежи</registerRecords>
  <attributes>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </attributes>
  <attributes>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОбещанногоПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусОбещанногоПлатежа</name>
    <type>
      <types>EnumRef.СтатусыОбещанныхПлатежей</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

DebtManagment/src/InformationRegisters/ОбещанныеПлатежи/ОбещанныеПлатежи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбещанныеПлатежи</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СуммаПлатежа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Плательщик</name>
    <type>
      <types>CatalogRef.Должники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаОбещанногоПлатежа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатусОбещанногоПлатежа</name>
    <type>
      <types>EnumRef.СтатусыОбещанныхПлатежей</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

DebtManagment/src/Documents/ОбещанныйПлатеж/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОбещанныеПлатежи
	Движения.ОбещанныеПлатежи.Записывать = Истина;
	Движение = Движения.ОбещанныеПлатежи.Добавить();
	Движение.Период = Дата;
	Движение.Плательщик = Плательщик;
	Движение.Долг = Долг;
	Движение.ДатаОбещанногоПлатежа = ДатаОбещанногоПлатежа;
	Движение.СтатусОбещанногоПлатежа = СтатусОбещанногоПлатежа;
	Движение.СуммаПлатежа = СуммаПлатежа;
	Движение.Комментарий = Комментарий;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
